app/Http/Controllers/Api/Admin/AuthController.php

    public function login(Request $request)
    {
        $request->validate([
            'username' => 'required|max:20',
            'password' => 'required|string',
        ]);

        $fields = $request->only(['username', 'password']);

        //Check username
        $admin = Admin::where('username', $fields['username'])->first();
---
SELECT * FROM `admin` WHERE `username` = 'admin' LIMIT 1