app/Sanctum/PersonalAccessToken.php

UPDATE `personal_access_tokens` SET `last_used_at` = '2024-05-07 07:00:15' WHERE `id` = 18
---
                    function () use ($personalAccessToken) {
                        DB::table($personalAccessToken->getTable())
                            ->where('id', $personalAccessToken->id)
                            ->update($personalAccessToken->getDirty());