app/Http/Controllers/Api/SiteGroup/AuthController.php

SELECT * FROM `site_group_admin` WHERE `username` = 'ecl_admin_01' LIMIT 1
UPDATE `site_group_admin` SET `last_login_at` = '2024-05-07 07:52:21', `site_group_admin`.`updated_at` = '2024-05-07 07:52:21' WHERE `id` = 1
---
    public function login(Request $request)
    {
        $request->validate([
            'username' => 'required|max:20',
            'password' => 'required|string',
        ]);

        $fields = $request->only('username', 'password');

        //Check username
        $siteGroupAdmin = SiteGroupAdmin::where('username', $fields['username'])->first();

        //Check password
        if (!$siteGroupAdmin || !Hash::check($fields['password'], $siteGroupAdmin->password)) {
            return api()->unauthenticated()
                ->message(__('api.admin.invalid_credential'))
                ->flush();
        }

        //Check site group & site status
        if (!$siteGroupAdmin->isSiteGroupActive() || !$siteGroupAdmin->isSiteActive()) {
            return api()->forbidden()
                ->message(__('api.site.status_inactive'))
                ->flush();
        }

        $token = $siteGroupAdmin->createToken('group-token')->plainTextToken;

        $siteGroupAdmin->last_login_at = Carbon::now();
        $siteGroupAdmin->save();